printf:输出语句，作用把引号里的信息输出到黑色屏幕上
电脑屏幕，显示器：输出设备
scanf:输入语句，作用把数据通过键盘输入进来存放到变量里 
键盘：输入设备
return 0;程序结束
文件名：未命名1.cpp  cpp:c++ .c:c
         主名.扩展名 
         AC  AK
include:包含
stdio.h：标准输入输出头文件 
int:integer整数
main：主要的
数据类型：
一： 
整数：不带小数点的数，0，12，-9
数据存放，空间，位置,名字
变量：存放数据，变量名字
命名规则：
1）字母大头，里面可以包含数字，_
a、a1、a2_3、  
在计算机根据数据范围的大小分三种： 
1、-2147483648---+2147483647，10位数，2^31-1 
   int a; 整数是32位有符号整数
2、-2147483648---+2147483647，10位数，2^31-1
   long (int) b;整数是32位有符号整数
3、-9223372036854775808---+9223372036854775807，19位数，2^63-1
   long long (int) c; 整数是64位有符号整数
   
8:人类世界用的数字，十进制的数
  1）由0、1、2、3、4、5、6、7、8、9共10个数码组成
  2）逢十进一，借一当十 
1000：计算机世界用的数字，二进制的数 
  1）由0、1共2个数码组成 
  2）逢二进一，借一当二
     1001
	-  11
	-----------
	  110 
二、浮点数：带小数点的输
在计算机中根据精度（准确的位数）分为两种：
1、单精度浮点数，精度是6-7位
   float %f
   12.123456789
2、双精度浮点数，精度是15到16位
   double %lf
   12.123456789123456789
科学计数法：
12.34=1.234*10^1
0.1234=1.234*10^-1

三、字符类型:一个字符
char %c
'*' 'A' '\n' '0' '!'
信息交换：'A'----65---1000001
           %c    %d
'A'65 ascii码
'B'66
....
'Z'90

'a'97
'b'98
....
'z'122

'0'48  ---------->0
'1'49
...
'9'57

double2.3--->int2   -2.3---->-2
2.6--->2   -2.6---->-2
 






 
