#include<iostream>
#include<cstring>
using namespace std;
int main()
{
   long d[5][5][5],f[10][10];
   memset(d,42,sizeof(d));          //有些路径是不通的,赋值为较大值，用于判断
   d[1][1][1]=5;d[1][1][2]=3;d[2][1][1]=1;  //以下给可通路径赋正常值
   d[2][1][2]=6;d[2][1][3]=3;d[2][2][2]=8;
   d[2][2][4]=4;d[3][1][1]=5;d[3][1][2]=6;
   d[3][2][1]=5;d[3][3][3]=8;d[3][4][3]=3;
   d[4][1][1]=3;d[4][2][1]=4;d[4][3][1]=3; 
   for (int i=0;i<=9;++i)
    for (int j=0;j<=9;++j) f[i][j]=10000000;
   f[5][1]=0;//从第i层到第j层的最短路径 
   for (int i=4;i>=1;--i)//第i层 
    for (int j=1;j<=4;++j)//第i层的第j个元素 
     for (int k=1;k<=4;++k)//第i+1层的第k个元素 
       if (f[i][j]>d[i][j][k]+f[i+1][k])    //即使走非法路径，也不影响答案
          f[i][j]=d[i][j][k]+f[i+1][k];
    cout<<f[1][1]<<endl;
}

